In [2]:
# Initial imports
import pandas as pd
from pathlib import Path

In [3]:
pd.to_datetime("today")

Timestamp('2023-03-06 19:13:18.691781')

In [5]:
# Read the data from the tsla_historical.csv file into a Pandas DataFrame
df_tsla = pd.read_csv(
    Path("tsla_historical.csv")
)
df_tsla.head()

                        time    close
0  2018-01-02 09:30:00-05:00  315.870
1  2018-01-02 09:45:00-05:00  317.500
2  2018-01-02 10:00:00-05:00  318.035
3  2018-01-02 10:15:00-05:00  317.470
4  2018-01-02 10:30:00-05:00  316.875

In [6]:
# Inspect the DataFrame's data types using the info function
df_tsla.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21279 entries, 0 to 21278
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   time    21279 non-null  object
 1   close   21279 non-null  float64
dtypes: float64(1), object(1)
memory usage: 332.6+ KB

In [7]:
# Transform the time column to a datetime data type
df_tsla["time"] = pd.to_datetime(
    df_tsla["time"],
    infer_datetime_format = True,
    utc = True    
)
df_tsla.head()

                       time    close
0 2018-01-02 14:30:00+00:00  315.870
1 2018-01-02 14:45:00+00:00  317.500
2 2018-01-02 15:00:00+00:00  318.035
3 2018-01-02 15:15:00+00:00  317.470
4 2018-01-02 15:30:00+00:00  316.875

In [8]:
df_tsla.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21279 entries, 0 to 21278
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   time    21279 non-null  datetime64[ns, UTC]
 1   close   21279 non-null  float64
dtypes: datetime64[ns, UTC](1), float64(1)
memory usage: 332.6 KB

In [9]:
# Convert the time column to the Europe/Berlin timezone
df_tsla["time"] = df_tsla["time"].dt.tz_convert("Europe/Berlin")
df_tsla.head()

                       time    close
0 2018-01-02 15:30:00+01:00  315.870
1 2018-01-02 15:45:00+01:00  317.500
2 2018-01-02 16:00:00+01:00  318.035
3 2018-01-02 16:15:00+01:00  317.470
4 2018-01-02 16:30:00+01:00  316.875

In [11]:
df_tsla.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21279 entries, 0 to 21278
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   time    21279 non-null  datetime64[ns, Europe/Berlin]
 1   close   21279 non-null  float64
dtypes: datetime64[ns, Europe/Berlin](1), float64(1)
memory usage: 332.6 KB

In [12]:
df_tsla["time"] = df_tsla["time"].dt.tz_convert("US/Eastern")
df_tsla.head()

                       time    close
0 2018-01-02 09:30:00-05:00  315.870
1 2018-01-02 09:45:00-05:00  317.500
2 2018-01-02 10:00:00-05:00  318.035
3 2018-01-02 10:15:00-05:00  317.470
4 2018-01-02 10:30:00-05:00  316.875

In [13]:
df_tsla.head()

                       time    close
0 2018-01-02 09:30:00-05:00  315.870
1 2018-01-02 09:45:00-05:00  317.500
2 2018-01-02 10:00:00-05:00  318.035
3 2018-01-02 10:15:00-05:00  317.470
4 2018-01-02 10:30:00-05:00  316.875